public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
/*
Написать библиотеку для работы с линейной алгеброй. Результат следует
оформить в виде отдельного модуля (пакета). Назвать можно, например, Math.
Реализовать несколько классов для работы:

• Вектора размерности 2, 3, 4 (это отдельные классы). Для них должны
быть:
– Операции сложения и вычитания
– Умножения и деления на скаляр
– Вычисления длины
– Нормализации
– Скалярного произведения
– Векторного произведения (Для вектора размерности 3)

• Матрицы размерности 3х3, 4х4 (это отдельные классы). Для них должны
быть:
– Операции сложения и вычитания
– Умножения на соответствующий вектор 3 или 4. Здесь и дальше по
курсу работаем с векторами-столбцами
– Перемножения матриц
– Транспонирования
– Быстрого задания единичной и нулевой матрицы (через конструктор
или метод)
Особенно важно покрыть весь код тестами, чтобы нажатием пары кнопок
можно было доказать, что он рабочий. Стоит также добавить обработку ошибок (например, деление на ноль).
Желающие могут добавить (возможно, частично) для существующих классов
пункты из следующего списка - поощрается дополнительными баллами:
• Вычисление определителя матриц
• Вычисление обратной матрицы
• Решение систем методом Гаусса
 */